
//программа спрашивает о названии комнаты из выпадающего меню
//открывается форма  с полями для ввода данных и списком работ в checkbox, каждая работа отвечает за определенный вид работ

//программа получает данные от пользователя через <form> input </form>  от HTML файла
// высота, ширина, длина помещения, наличие окон и дверей, получение  их размеров    
// вычисление площадей и периметров стен, окон, дверей, (обработка данных)
// добавление дополнительной формы для каждой комнаты или помешения 
// у каждой  комнаты определенный список работ
// После получения и обработки данных, происходит формирование сметы в виде таблицы
//смета отправляется на почту клиента
//так же формируется несколько отчетов для прораба с списком материала по каждому виду работ (сантехника, покраска, электрика) и 
// направление заказа на материал непосредственно поставщику
//расценки на работы вводятся единовременно  и пользователь не имеет возможности их изменять.
//изменение расценок на работы производится в панели управления владельцем программы через свою учетную запись 
// стоимость материалов собирается из открытых источников, таких как леруа мерлен и тому подопбных 